CompositeAppAuth/src/jbiasa/CompositeAppAuth.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="CompositeAppAuth"
             xmlns:tns="CompositeAppAuth" xmlns:ns="http://j2ee.netbeans.org/wsdl/BpelAuthentification/AuthentificateWSDL" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <import namespace="http://j2ee.netbeans.org/wsdl/BpelAuthentification/AuthentificateWSDL" location="../jbiServiceUnits/BpelAuthentification/AuthentificateWSDL.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="casaBinding1" type="ns:AuthentificateWSDLPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="AuthentificateWSDLOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="CompositeAppAuth"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="CompositeAppAuth"/>
            </output>
        </operation>
    </binding>
    <service name="CompositeAppAuthService1">
        <port name="casaPort1" binding="tns:casaBinding1">
            <soap:address location="http://localhost:${HttpDefaultPort}/CompositeAppAuthService1/casaPort1"/>
        </port>
    </service>
</definitions>

