CompositeAppAuth/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:com="CompositeAppAuth" xmlns:aut="http://xml.netbeans.org/schema/AuthentificationXmlSchema">
  <soapenv:Body>
    <com:AuthentificateWSDLOperation>
      <request>
        <aut:password>tamere</aut:password>
        <aut:login>toto</aut:login>
      </request>
    </com:AuthentificateWSDLOperation>
  </soapenv:Body>
</soapenv:Envelope>